baseline/perf/root.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain1
      duration: 60
      arrivalRate: 5
    - name: Ramp1
      duration: 60
      arrivalRate: 5
      rampTo: 10
    - name: Plain2
      duration: 60
      arrivalRate: 10
    - name: Ramp2
      duration: 60
      arrivalRate: 10
      rampTo: 25
    - name: Plain3
      duration: 60
      arrivalRate: 25
    

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/ping'